stubs/src/main/resources/wsdl/nfe/ms/prod/status_service.wsdl

<?xml version='1.0' encoding='UTF-8'?><wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:ns1="http://schemas.xmlsoap.org/soap/http" name="NFeStatusServico4" targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4">
  <wsdl:types>
<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" elementFormDefault="qualified" targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4" version="1.0">

  <xs:element name="nfeDadosMsg">
    <xs:complexType mixed="true">
      <xs:sequence>
        <xs:any namespace="##other" processContents="lax"/>
      </xs:sequence>
    </xs:complexType>
  </xs:element>

  <xs:element name="nfeResultMsg">
    <xs:complexType mixed="true">
      <xs:sequence>
        <xs:any namespace="##other" processContents="lax"/>
      </xs:sequence>
    </xs:complexType>
  </xs:element>

</xs:schema>
  </wsdl:types>
  <wsdl:message name="nfeStatusServicoNF">
    <wsdl:part element="tns:nfeDadosMsg" name="nfeDadosMsg">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="nfeStatusServicoNFResponse">
    <wsdl:part element="tns:nfeResultMsg" name="nfeStatusServicoNFResult">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="NFeStatusServico4">
    <wsdl:operation name="nfeStatusServicoNF">
      <wsdl:input message="tns:nfeStatusServicoNF" name="nfeStatusServicoNF">
    </wsdl:input>
      <wsdl:output message="tns:nfeStatusServicoNFResponse" name="nfeStatusServicoNFResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="NFeStatusServico4SoapBinding" type="tns:NFeStatusServico4">
    <soap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="nfeStatusServicoNF">
      <soap12:operation soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4/nfeStatusServicoNF" style="document"/>
      <wsdl:input name="nfeStatusServicoNF">
        <soap12:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="nfeStatusServicoNFResponse">
        <soap12:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="NFeStatusServico4">
    <wsdl:port binding="tns:NFeStatusServico4SoapBinding" name="nfeStatusServico4Soap12">
      <soap12:address location="https://nfe.sefaz.ms.gov.br/ws/NFeStatusServico4"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>